Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Treat Vision Pro as an iOS-class device
zh_hans: 将 Vision Pro 视为 iOS 类设备

source: Treat Vision Pro as an iOS-class target: reach Rockxy across the local network, install the root certificate on the device, and trust it in the settings.
zh_hans: 将 Vision Pro 视为 iOS 级目标：在本地网络中访问 Rockxy，在设备上安装根证书，并在设置中信任它。

source: Tree View
zh_hans: 树状视图

source: Trigger a known HTTPS flow once
zh_hans: 触发一次已知的 HTTPS 流程

source: Trigger a single HTTPS request
zh_hans: 触发单个 HTTPS 请求

source: Trigger one known HTTPS request
zh_hans: 触发一个已知的 HTTPS 请求

# Truncated · %lld/%lld bytes
source: Truncated · %1$lld/%2$lld bytes
zh_hans: 已截断 · %1$lld/%2$lld 字节

source: Trust
zh_hans: 信任

source: Trust and export the Rockxy root certificate before validating HTTPS requests.
zh_hans: 在验证 HTTPS 请求之前，请信任并导出 Rockxy 根证书。

source: trust incomplete
zh_hans: 信任不完整

source: Trust Incomplete
zh_hans: 信任不完整

source: Trust Root Certificate
zh_hans: 信任根证书

source: Trust Settings
zh_hans: 信任设置

source: Trust settings exist but macOS validation failed.
zh_hans: 信任设置存在，但 macOS 验证失败。

source: Trust settings exist, but macOS TLS validation still fails. Repair trust, then recheck the certificate.
zh_hans: 信任设置已存在，但 macOS TLS 验证仍然失败。请修复信任设置，然后重新检查证书。

source: macOS has not validated the certificate for TLS. Recheck the status before changing your certificate or trust settings.
zh_hans: macOS 尚未验证此证书可用于 TLS。更改证书或信任设置前，请重新检查状态。

source: Trust Settings:
zh_hans: 信任设置：

source: Trust the certificate
zh_hans: 信任证书

source: Trust the certificate so intercepted HTTPS connections are accepted.
zh_hans: 信任证书，以便接受拦截的 HTTPS 连接。

source: Trust the root certificate inside the simulator
zh_hans: 在模拟器中信任根证书

source: Trust with Terminal
zh_hans: 使用终端设置信任

source: trusted
zh_hans: 受信任

source: Trusted
zh_hans: 受信任

source: Try a different app or host search.
zh_hans: 尝试其他应用或主机搜索。

source: Try a different domain or path prefix.
zh_hans: 尝试其他域名或路径前缀。

source: Try a different header name.
zh_hans: 请尝试其他标头名称。

source: Try a different host pattern or behavior.
zh_hans: 尝试其他主机模式或行为。

source: Try a different host pattern.
zh_hans: 请尝试其他主机模式。

source: Try a different kind, source, or search term.
zh_hans: 请尝试其他种类、来源或搜索词。

source: Try a different name, method, or matching rule.
zh_hans: 请尝试其他名称、方法或匹配规则。

source: Try a different name, method, or URL pattern.
zh_hans: 请尝试其他名称、方法或 URL 模式。

source: Try a different name, method, phase, or URL pattern.
zh_hans: 请尝试其他名称、方法、阶段或 URL 模式。

source: Try a different name, method, URL, or destination.
zh_hans: 请尝试其他名称、方法、URL 或目标。

source: Try a different name, method, URL, or local path.
zh_hans: 请尝试其他名称、方法、URL 或本地路径。

source: Try a different name, scope, or profile.
zh_hans: 请尝试其他名称、范围或配置文件。

source: Try a different template name.
zh_hans: 尝试其他模板名称。

source: Try Again
zh_hans: 重试

source: Try another runtime, browser, framework, environment, or category name.
zh_hans: 尝试其他运行时、浏览器、框架、环境或类别名称。

source: Try Background Items Reset
zh_hans: 尝试重置后台项

source: Try Chrome before the target app
zh_hans: 在目标应用之前先尝试 Chrome

source: Tunnel Without Decryption
zh_hans: 不解密隧道

source: Turn on HTTPS decryption for new connections to %@
zh_hans: 为连接到 %@ 的新连接启用 HTTPS 解密

source: Add host decryption rules for other known hosts used by %@; these rules apply to every application
zh_hans: 为 %@ 使用的其他已知主机添加主机解密规则；这些规则适用于所有应用程序

source: Turn this traffic into a concise bug report.
zh_hans: 将此流量整理成简明的错误报告。

source: tvOS and watchOS follow the iOS device and simulator paths.
zh_hans: tvOS 和 watchOS 遵循 iOS 设备和模拟器路径。

source: tvOS and watchOS reuse the iOS device or simulator path: Rockxy must be reachable and the root certificate must be trusted on the runtime.
zh_hans: tvOS 和 watchOS 沿用 iOS 设备或模拟器路径：运行时必须能够连接 Rockxy，并信任根证书。

source: Tx Hash
zh_hans: 事务哈希

source: Type
zh_hans: 类型

source: Type:
zh_hans: 类型：

source: Unable to display content
zh_hans: 无法显示内容

source: Unable to Preview
zh_hans: 无法预览

source: Unable to start PAC evaluation.
zh_hans: 无法启动 PAC 求值。

source: Unavailable
zh_hans: 不可用

source: Unavailable: %@. Missing fields are not inferred.
zh_hans: 不可用：%@。不会推断缺失字段。

source: Unexpected '='.
zh_hans: 意外的 ‘=’。

source: Unexpected character '%@'.
zh_hans: 意外字符 ‘%@’。

source: Unexpected token at end of query.
zh_hans: 查询末尾出现意外令牌。

source: Unified
zh_hans: 统一

source: Uninstall
zh_hans: 卸载

source: Uninstall Helper Tool?
zh_hans: 卸载辅助工具？

source: Uninstall Plugin
zh_hans: 卸载插件

source: unknown
zh_hans: 未知

source: Unknown
zh_hans: 未知

source: Unknown catalog error
zh_hans: 未知目录错误

source: Unknown client
zh_hans: 未知客户端

source: Unknown compression flag %u
zh_hans: 未知压缩标志 %u

source: Unknown gRPC method
zh_hans: 未知 gRPC 方法

source: Unknown host
zh_hans: 未知主机

source: Unknown Host
zh_hans: 未知主机

source: Unknown method
zh_hans: 未知方法

source: Unknown PAC error
zh_hans: 未知 PAC 错误

source: Unknowns
zh_hans: 未知项

source: Unlisted and not searchable on GitHub, but anyone with the link can open it.
zh_hans: 未公开列出且无法在 GitHub 上搜索到，但任何拥有链接的人都可以打开它。

source: Unmute %@
zh_hans: 取消静音 %@

source: Unmute All
zh_hans: 取消全部静音

source: Unnamed operation
zh_hans: 未命名操作

source: Unpin
zh_hans: 取消置顶

source: Unpin another Assistant conversation before pinning this one.
zh_hans: 置顶此助手对话前，请先取消置顶另一个对话。

source: Unpin Evidence
zh_hans: 取消置顶证据

source: Unpin Request
zh_hans: 取消置顶请求

source: Unpin the selected request from the current session.
zh_hans: 从当前会话中取消置顶所选请求。

source: Unreachable
zh_hans: 无法访问

source: Unsave
zh_hans: 取消保存

source: Unsave Request
zh_hans: 取消保存请求

source: Unsaved changes
zh_hans: 未保存的更改

source: Unsaved Changes
zh_hans: 未保存的更改

source: Unsaved listener changes
zh_hans: 未保存的监听器更改

source: Unsupported function %@.
zh_hans: 不支持函数 %@。

source: Unterminated escape sequence.
zh_hans: 转义序列未终止。

source: Unterminated regex.
zh_hans: 正则表达式未终止。

source: Unterminated string.
zh_hans: 字符串未终止。

source: Untitled
zh_hans: 未命名

source: Untitled Request Template
zh_hans: 未命名请求模板

source: Untitled Response Template
zh_hans: 未命名响应模板

source: Untitled Script
zh_hans: 未命名脚本

source: Untitled Template
zh_hans: 未命名模板

source: Up: ⌘↑
zh_hans: 上移：⌘↑

source: Update
zh_hans: 更新

source: Update Available
zh_hans: 有可用更新

source: Update Controls
zh_hans: 更新控制项

source: Update Details
zh_hans: 更新详细信息

source: Update Helper
zh_hans: 更新 Helper

source: Update Installed
zh_hans: 更新已安装

source: Update needed
zh_hans: 需要更新

source: Updates are signed and verified before Rockxy installs them.
zh_hans: Rockxy 安装更新前，会验证更新的签名。

source: Upload
zh_hans: 上传

source: Upstream Bypass
zh_hans: 上游绕过

source: Upstream proxy authentication is required.
zh_hans: 需要上游代理身份验证。

source: Upstream proxy authentication is unavailable in this build.
zh_hans: 此构建不支持上游代理认证。

source: Upstream proxy authentication was rejected.
zh_hans: 上游代理身份验证被拒绝。

source: Upstream proxy bypass host patterns
zh_hans: 上游代理绕过主机模式

source: Upstream proxy bypass list is limited to %lld entries in this build.
zh_hans: 此构建的上游代理绕过列表最多可包含 %lld 个条目。

source: Upstream proxy bypass list is limited to %lld entries.
zh_hans: 上游代理绕过列表最多可包含 %lld 个条目。

source: Upstream proxy bypass pattern is invalid: %@
zh_hans: 上游代理绕过模式无效：%@

source: Upstream proxy CONNECT failed with HTTP %lld.
zh_hans: 上游代理 CONNECT 失败，HTTP %lld。

source: Upstream proxy connection timed out.
zh_hans: 上游代理连接超时。

source: Upstream proxy handshake response exceeded the size limit.
zh_hans: 上游代理握手响应超过大小限制。

source: Upstream proxy host
zh_hans: 上游代理主机

source: Upstream proxy host is invalid.
zh_hans: 上游代理主机无效。

source: Upstream Proxy is disabled.
zh_hans: 上游代理已停用。

source: Upstream proxy password must be 255 bytes or fewer.
zh_hans: 上游代理密码不得超过 255 字节。

source: Upstream proxy port
zh_hans: 上游代理端口

source: Upstream proxy port must be between 1 and 65535.
zh_hans: 上游代理端口必须介于 1 和 65535 之间。

source: Upstream proxy protocol
zh_hans: 上游代理协议

source: Upstream proxy returned a malformed response.
zh_hans: 上游代理返回了格式错误的响应。

source: Upstream Proxy settings saved.
zh_hans: 上游代理设置已保存。

source: Upstream proxy username must be 255 bytes or fewer.
zh_hans: 上游代理用户名不得超过 255 字节。

source: URL pattern
zh_hans: URL 模式

source: URL Pattern
zh_hans: URL 模式

source: URL Pattern (regex)
zh_hans: URL 模式（正则表达式）

source: Usage
zh_hans: 用量

source: Usage fields were not present in the captured provider response.
zh_hans: 捕获的提供商响应中不存在用量字段。

source: Use
zh_hans: 使用

source: Use * alone, or *.domain.com for subdomains.
zh_hans: 单独使用 *，或使用 *.domain.com 匹配子域名。

source: Use 127.0.0.1 for iOS Simulator or desktop Flutter, 10.0.2.2 for Android Emulator, and the Device Proxy LAN host for physical devices.
zh_hans: iOS 模拟器或桌面版 Flutter 请使用 127.0.0.1，Android 模拟器请使用 10.0.2.2，实体设备请使用“设备代理”的局域网主机。

source: Use a proxy-aware Flutter client such as HttpClient, package:http, or Dio, then keep the iOS or Android device/emulator trust and proxy setup aligned with where the app runs.
zh_hans: 使用支持代理的 Flutter 客户端，例如 HttpClient、package:http 或 Dio，然后保持 iOS 或 Android 设备/模拟器的信任和代理设置与应用运行的位置一致。

source: Use any application
zh_hans: 使用任何应用程序

source: Use console.log() to log events
zh_hans: 使用 console.log() 记录事件

source: Use different message types for request and response
zh_hans: 为请求和响应使用不同的消息类型

source: Use Empty Body
zh_hans: 使用空正文

source: Use Extended Controls > Settings > Proxy, or start the emulator with -http-proxy, so the Android system picks up Rockxy.
zh_hans: 使用“扩展控制”>“设置”>“代理”，或使用 -http-proxy 启动模拟器，以便 Android 系统识别 Rockxy。

source: Use External Proxy
zh_hans: 使用外部代理

source: Use Globally
zh_hans: 全局使用

source: Use letters, digits, or ! # $ % & ' * + - . ^ _ ` | ~ — no spaces or colons.
zh_hans: 使用字母、数字或 ! # $ % & ' * + - . ^ _ ` | ~，不能包含空格或冒号。

source: Use Manual Setup
zh_hans: 使用手动设置

source: Use Monospaced Font
zh_hans: 使用等宽字体

source: Use one of the Snippets tab variants for HttpClient, package:http, or Dio so the client explicitly routes debug traffic through Rockxy.
zh_hans: 请使用“代码片段”标签页中适用于 HttpClient、package:http 或 Dio 的变体，让客户端明确通过 Rockxy 路由调试流量。

source: Use Regex
zh_hans: 使用正则表达式

source: Use Rockxy's local proxy address and exported root certificate with your Ruby client.
zh_hans: 让你的 Ruby 客户端使用 Rockxy 的本地代理地址和导出的根证书。

source: Use Rockxy's local proxy address and root certificate with your Python HTTP client.
zh_hans: 将 Rockxy 的本地代理地址和根证书用于 Python HTTP 客户端。

source: Use Rockxy's local proxy address with --proxy or HTTP_PROXY / HTTPS_PROXY and trust the exported root certificate.
zh_hans: 通过 --proxy 或 HTTP_PROXY / HTTPS_PROXY 使用 Rockxy 的本地代理地址，并信任导出的根证书。

source: Use saved credentials for the upstream proxy.
zh_hans: 对上游代理使用已保存的凭据。

source: Use Share Certificate in Developer Setup or export the Rockxy PEM, install it in the simulator, then enable full trust under Settings > General > About > Certificate Trust Settings.
zh_hans: 在开发者设置中使用“共享证书”，或导出 Rockxy PEM 并安装到模拟器，然后在“设置”>“通用”>“关于本机”>“证书信任设置”中启用完全信任。

source: Use the fetch probe after platform setup
zh_hans: 完成平台设置后使用 fetch 探测

source: Use the horizontal inspector to review individual frames.
zh_hans: 使用水平检查器审查各个帧。

source: Use the host that matches the runtime
zh_hans: 使用与运行时匹配的主机

source: Use the manual validation steps in this Dev Hub guide.
zh_hans: 使用此 Dev Hub 指南中的手动验证步骤。

source: Use the reqwest snippet to point Rust traffic at Rockxy and trust the root certificate.
zh_hans: 使用 reqwest 代码片段将 Rust 流量指向 Rockxy，并信任根证书。

source: Use this as provider/chain baseline before comparing app calls.
zh_hans: 在比较应用调用之前，将其用作提供商/链的基线。

source: Use this command if you prefer Terminal or Keychain Access cannot complete the trust change.
zh_hans: 如果你更喜欢终端，或者钥匙串访问无法完成信任更改，请使用此命令。

source: Use this host and port when configuring a device, simulator, or client on the same network.
zh_hans: 在同一网络上配置设备、模拟器或客户端时，请使用此主机和端口。

source: Use Token...
zh_hans: 使用令牌...

source: Use Wildcard
zh_hans: 使用通配符

source: User
zh_hans: 用户

source: User Logs
zh_hans: 用户日志

source: Username
zh_hans: 用户名

source: VALID
zh_hans: 有效

source: Valid From
zh_hans: 生效日期

source: Valid From:
zh_hans: 有效期始于：

source: Valid request message
zh_hans: 有效的请求消息

source: Valid response message
zh_hans: 有效的响应消息

source: Valid template
zh_hans: 有效模板

source: Valid Until
zh_hans: 有效期至

source: Valid Until:
zh_hans: 有效期至：

source: Validate
zh_hans: 验证

source: Validation failed
zh_hans: 验证失败

source: Validation failed: %@
zh_hans: 验证失败：%@

source: Validation passed.
zh_hans: 验证通过。

source: Value
zh_hans: 值

source: Variables
zh_hans: 变量

source: Verification required
zh_hans: 需要验证

source: Verify
zh_hans: 验证

source: Verify Certificate
zh_hans: 验证证书

source: Verify declared tool name, arguments, completion state, and app-side tool result follow-up.
zh_hans: 验证声明的工具名称、参数、完成状态以及应用端工具结果的后续处理。

source: Verify each subcall belongs together and watch for mixed read/write calls in one request.
zh_hans: 请确认各个子调用属于同一组，并留意一个请求中混合出现的读取和写入调用。

source: Verifying archive, developer signature, and Gatekeeper approval…
zh_hans: 正在验证归档、开发者签名和 Gatekeeper 批准…

source: Verifying Custom Root…
zh_hans: 正在验证自定义根证书…

source: Version %@
zh_hans: 版本 %@

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@ (%2$@)

source: View
zh_hans: 视图

source: View Advanced Diagnostics
zh_hans: 查看高级诊断

source: View Full Change Log
zh_hans: 查看完整更改日志

source: View Overview
zh_hans: 查看概览

source: View Setup
zh_hans: 查看设置

source: View Snippet
zh_hans: 查看代码片段

source: View Snippets
zh_hans: 查看代码片段

source: View the public source and license on GitHub
zh_hans: 在 GitHub 上查看公开源代码和许可证

source: View Validation
zh_hans: 查看验证

source: Visible / Filtered
zh_hans: 可见 / 已过滤

source: Visible / Filtered Requests
zh_hans: 可见/已筛选请求

source: Vision Pro follows the iOS device class of setup.
zh_hans: Vision Pro 沿用 iOS 设备类别的设置。

source: Vision Pro has no dedicated Rockxy workflow yet
zh_hans: Vision Pro 尚无专用的 Rockxy 工作流程

source: VPN or iCloud Private Relay detected (%@). Traffic may not be captured. Disable VPN/Private Relay to use Rockxy.
zh_hans: 检测到 VPN 或 iCloud 专用代理（%@）。可能无法捕获流量。请停用 VPN/专用代理以使用 Rockxy。

source: Wait briefly, then retry the request once.
zh_hans: 稍等片刻，然后重试一次请求。

source: Wait for the active Project capture to finish clearing, then try again.
zh_hans: 等待当前项目捕获完成清除，然后重试。

source: Wait for the server-specified Retry-After delay, then retry the request once.
zh_hans: 等待服务器指定的 Retry-After 延迟，然后重试该请求一次。

source: Waiting for Frames
zh_hans: 正在等待帧

source: Waiting for local probe
zh_hans: 正在等待本地探测

source: Waiting for Network
zh_hans: 正在等待网络

source: Waiting for Requests
zh_hans: 正在等待请求

source: Waiting for response...
zh_hans: 正在等待响应...

source: Waiting for Review Data
zh_hans: 正在等待审查数据

source: Waiting for the local Babylon listener to come online.
zh_hans: 正在等待本地 Babylon 监听器上线。

source: Waiting for the running app process to exit before replacing the bundle.
zh_hans: 正在等待运行中的 App 进程退出，然后再替换 App 包。

source: Waiting for the running app process to terminate safely.
zh_hans: 正在等待运行中的应用进程安全终止。

source: Waiting for Traffic
zh_hans: 正在等待流量

source: Warnings
zh_hans: 警告

source: Web Proxy (HTTP)
zh_hans: Web 代理 (HTTP)

source: WebSocket connection
zh_hans: WebSocket 连接

source: WebSocket connection established. Frames will appear here as they arrive.
zh_hans: WebSocket 连接已建立。帧到达后将显示在此处。

source: WebSocket frames
zh_hans: WebSocket 帧

source: WebSocket requests cannot be replayed as HTTP requests.
zh_hans: 无法将 WebSocket 请求作为 HTTP 请求重放。

source: WebSocket sessions and valid upgrade handshakes
zh_hans: WebSocket 会话和有效的升级握手

source: WebSocket transactions cannot be replayed as HTTP requests
zh_hans: WebSocket 事务无法作为 HTTP 请求重放

source: Weekly
zh_hans: 每周

source: Welcome
zh_hans: 欢迎

source: Welcome to Rockxy
zh_hans: 欢迎使用 Rockxy

source: What authentication evidence should I verify next?
zh_hans: 接下来我应该验证哪些身份验证证据？

source: What should I add before sharing this bug report?
zh_hans: 在共享此错误报告之前，我应该添加什么？

source: What should I inspect next in Rockxy?
zh_hans: 接下来我应该在 Rockxy 中检查什么？

source: When enabled, Rockxy downloads signed updates ahead of time so install prompts are faster.
zh_hans: 启用后，Rockxy 会提前下载已签名的更新，从而更快显示安装提示。

source: When matched
zh_hans: 匹配时

source: When off, Block List rules are skipped. Other intervention rules remain active.
zh_hans: 关闭后将跳过阻止列表规则。其他干预规则仍保持生效。

source: When off, Modify Header rules are skipped during evaluation. Other rule types are unaffected.
zh_hans: 关闭后，求值时会跳过修改标头规则。其他规则类型不受影响。

source: When off, Rockxy captures all traffic. Individual Allow List rules keep their enabled state.
zh_hans: 关闭后，Rockxy 会捕获所有流量。各允许列表规则会保留其启用状态。

source: When off, Rockxy sends store=false with every Responses API request.
zh_hans: 关闭后，Rockxy 会随每个 Responses API 请求发送 store=false。

source: When off, Rockxy tunnels all HTTPS without decrypting it. Individual rules keep their state.
zh_hans: 关闭后，Rockxy 会通过隧道传输所有 HTTPS 而不进行解密。各条规则会保留其状态。

source: Where
zh_hans: 位置

source: Which captured difference should I verify first?
zh_hans: 我应该先验证哪个已捕获的差异？

source: Why did this request fail?
zh_hans: 此请求为什么失败？

source: Wildcard
zh_hans: 通配符

source: Wildcard patterns support * for any sequence and ? for one character. Turn on Include subpaths to extend the match beyond this URL.
zh_hans: 通配符模式支持用 * 匹配任意字符序列，用 ? 匹配单个字符。开启“包含子路径”可将匹配范围扩展到此 URL 之外。

source: Wire Type
zh_hans: 线类型

source: Wire-format heuristic
zh_hans: 线格式启发式检测

source: Word Wrap
zh_hans: 自动换行

source: Write-like transaction/signature path
zh_hans: 写入类事务/签名路径

source: Wrong snippet chosen
zh_hans: 选择了错误的代码片段

source: XPC Reachability:
zh_hans: XPC 可访问性：

source: Yellow
zh_hans: 黄色

source: Yes
zh_hans: 是

source: You can cancel this check at any time.
zh_hans: 你可以随时取消此检查。

source: You can still review the full release history.
zh_hans: 你仍可查看完整的发布历史。

source: You see the exact redacted snapshot before it is processed.
zh_hans: 处理前，你会看到经过脱敏的确切快照。

source: You: %@
zh_hans: 你：%@

source: You’re All Set!
zh_hans: 一切准备就绪！

source: Your current recording Request/Response data will be lost.
zh_hans: 当前记录的请求/响应数据将会丢失。

source: Your current recording Request/Response data will be lost. Rockxy will stop capturing and restore macOS proxy settings before quitting.
zh_hans: 当前记录的请求/响应数据将丢失。Rockxy 将停止捕获，并在退出前恢复 macOS 代理设置。

source: Allow List Captures Nothing
zh_hans: 允许列表不会捕获任何流量

source: Allow List is on, but no valid enabled rule can match. Traffic is still proxied, but it is not recorded.
zh_hans: 允许列表已开启，但没有有效的已启用规则可以匹配。流量仍会被代理，但不会被记录。

source: Capture Is Not Verified
zh_hans: 捕获尚未验证

source: Capture Needs Attention
zh_hans: 捕获需要处理

source: Capture path
zh_hans: 捕获链路

source: Check failed
zh_hans: 检查失败

source: Checking Capture
zh_hans: 正在检查捕获

source: Checking…
zh_hans: 正在检查…

source: HTTPS traffic is staying as CONNECT tunnels because no Decrypt rule is enabled.
zh_hans: 未启用任何“解密”规则，因此 HTTPS 流量将以 CONNECT 隧道形式保留。

source: Local path verified
zh_hans: 本地链路已验证

source: Not checked
zh_hans: 尚未检查

source: Open Allow List and enable or create a valid rule.
zh_hans: 打开允许列表并启用或创建有效规则。

source: Restore System Routing
zh_hans: 恢复系统代理路由

source: Rockxy could not verify its local capture path. The listener is running, but capture is not confirmed.
zh_hans: Rockxy 无法验证本地捕获链路。监听器正在运行，但尚未确认能够捕获。

source: Rockxy could not restore the previous system proxy settings. Capture remains running so network traffic stays reachable.
zh_hans: Rockxy 无法恢复之前的系统代理设置。捕获将继续运行，以保持网络流量可达。

source: Rockxy is sending a private loopback request through the listener to verify the capture path.
zh_hans: Rockxy 正在通过监听器发送私有环回请求，以验证捕获链路。

source: Rockxy's listener is running, but macOS browser traffic is routed elsewhere. Manually configured apps can still use the listener.
zh_hans: Rockxy 的监听器正在运行，但 macOS 浏览器流量被路由到了其他位置。手动配置的应用仍可使用该监听器。

source: Root CA trust is ready for HTTPS decryption.
zh_hans: Root CA 信任已就绪，可用于 HTTPS 解密。

source: Route macOS HTTP and HTTPS traffic through the running Rockxy listener.
zh_hans: 将 macOS HTTP 和 HTTPS 流量路由到正在运行的 Rockxy 监听器。

source: Run Capture Check
zh_hans: 运行捕获检查

source: Runs on start
zh_hans: 启动时运行

source: Send another private loopback request through the running listener.
zh_hans: 再次通过运行中的监听器发送私有环回请求。

source: System Traffic Is Not Routed
zh_hans: 系统流量未路由

source: The listener is running, but automatic capture is not fully verified.
zh_hans: 监听器正在运行，但自动捕获尚未完全验证。

source: The listener is running, but Rockxy's private loopback request did not complete as a captured transaction.
zh_hans: 监听器正在运行，但 Rockxy 的私有环回请求未能作为已捕获事务完成。

source: Verifying the live listener with a private loopback request.
zh_hans: 正在使用私有环回请求验证实时监听器。

source: Configured access
zh_hans: 配置的访问范围

source: Configured endpoint
zh_hans: 配置的端点

source: Configured endpoint: %@
zh_hans: 配置的端点：%@

source: Starting on %@
zh_hans: 正在于 %@ 启动

source: macOS system traffic is not routed to Rockxy. The listener may still accept manually configured apps, but browser traffic will not be captured automatically.
zh_hans: macOS 系统流量未路由到 Rockxy。监听器仍可接收手动配置的应用流量，但浏览器流量不会自动被捕获。
